docs/leets/1653-Minimum-Deletions-to-Make-String-Balanced.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-08-12 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>1653. Minimum Deletions to Make String Balanced</title>
<meta name="author" content="d)zharii" />
<meta name="generator" content="Org Mode" />
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<link rel="stylesheet" href="/static/t.css"/>
</head>
<body>
<nav><a href="/" tabindex="0">&larrhk; Back to Index</a></nav><div id="preamble" class="status">
Published 2024-07-29
</div>
<div id="content" class="content">
<header>
<h1 class="title">1653. Minimum Deletions to Make String Balanced</h1>
<p class="subtitle" role="doc-subtitle">leetcode</p>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org0a66c68">Links</a></li>
<li><a href="#orgf81a03e">Problem:</a></li>
<li><a href="#org41ee6bb">Solution Description:</a></li>
<li><a href="#org3f1ae4b">Time Complexity: O(n), where n is the length of the string.</a></li>
<li><a href="#orga9de06b">Space Complexity: O(1), as we use a constant amount of extra space.</a></li>
<li><a href="#org75bf3b8">Example:</a></li>
<li><a href="#orgb10b106">Setup:</a></li>
<li><a href="#orgd846ef2">Test Execution:</a></li>
</ul>
</div>
</nav>

<div id="outline-container-org0a66c68" class="outline-2">
<h2 id="org0a66c68">Links</h2>
<div class="outline-text-2" id="text-org0a66c68">
<ul class="org-ul">
<li>Submission <a href="https://leetcode.com/submissions/detail/1337966430/">2024-07-30 Minimum Deletions to Make String Balanced - Submission Detail - LeetCode</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgf81a03e" class="outline-2">
<h2 id="orgf81a03e">Problem:</h2>
<div class="outline-text-2" id="text-orgf81a03e">
<p>
The problem "1653. Minimum Deletions to Make String Balanced" from LeetCode requires you to find the minimum number of deletions needed to make a given string `s`, which consists of characters 'a' and 'b', balanced. A string is considered balanced if there is no 'b' that appears before an 'a' in the string.
</p>
</div>
</div>

<div id="outline-container-org41ee6bb" class="outline-2">
<h2 id="org41ee6bb">Solution Description:</h2>
<div class="outline-text-2" id="text-org41ee6bb">
<p>
To implement the solution, we need to keep track of the prefixes of 'a' and 'b'. Specifically, we can calculate the minimum deletions required to balance the string using a single pass through the string, maintaining a count of 'b's seen before each 'a'. We achieve this by tracking cumulative counts of 'b's and calculating the minimum number of deletions at each step.
</p>

<ol class="org-ol">
<li>Initialize a counter for the number of 'b's.</li>
<li>Traverse through the string.</li>
<li>For each character:
<ul class="org-ul">
<li>If it is 'b', increment the 'b' counter.</li>
<li>If it is 'a', compute deletions needed to remove either this 'a' or all previous 'b's, update the minimum deletions required.</li>
</ul></li>
<li>Return the computed minimum deletions.</li>
</ol>
</div>
</div>

<div id="outline-container-org3f1ae4b" class="outline-2">
<h2 id="org3f1ae4b">Time Complexity: O(n), where n is the length of the string.</h2>
</div>
<div id="outline-container-orga9de06b" class="outline-2">
<h2 id="orga9de06b">Space Complexity: O(1), as we use a constant amount of extra space.</h2>
</div>

<div id="outline-container-org75bf3b8" class="outline-2">
<h2 id="org75bf3b8">Example:</h2>
<div class="outline-text-2" id="text-org75bf3b8">
<p>
Let's consider the string "aababbab":
</p>
<ul class="org-ul">
<li>Initialize bCount = 0 and minDeletions = 0.</li>
<li>Iterate through the string and update counts:
<ul class="org-ul">
<li>On encountering 'b', increment bCount.</li>
<li>On encountering 'a', update minDeletions to the minimum of itself or the current bCount.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgb10b106" class="outline-2">
<h2 id="orgb10b106">Setup:</h2>
<div class="outline-text-2" id="text-orgb10b106">
<p>
Here is the general framework of the solution in JavaScript. We'll include a testing setup using `console.log` statements to verify the correctness of our solution.
</p>
</div>
</div>

<div id="outline-container-orgd846ef2" class="outline-2">
<h2 id="orgd846ef2">Test Execution:</h2>
<div class="outline-text-2" id="text-orgd846ef2">
<p>
We will define multiple test cases and verify if the implemented solution meets the expected output.
</p>

<div class="org-src-container">
<pre class="src src-js">
/**
 * Function to compute the minimum deletions to make the string balanced
 * @param {string} s - The input string containing characters 'a' and 'b'
 * @returns {number} - The minimum number of deletions needed to make the string balanced
 */
function minDeletionsToMakeStringBalanced(s) {
    /**
     * Log results only if NestedInteger is not defined (for debugging purposes).
     */
    const log = typeof NestedInteger !== 'undefined' ? () =&gt; {} : console.log;
    const table = typeof NestedInteger !== 'undefined' ? () =&gt; {} : console.table;


    log(`Processing string: ${s}`);

    let bs = 0;
    let dels = 0;

    for (const ch of s) {
        if (ch === 'b') {
            bs += 1;
        } else {
            dels = Math.min(dels + 1, bs);
        }

    }
    return dels;
}

// Test cases
const testCases = [
    { s: "aababbab", expected: 2 },
    { s: "bbaaaa", expected: 2 },
    { s: "abababab", expected: 4 },
    { s: "aaaaa", expected: 0 },
    { s: "bbbb", expected: 0 },
];

testCases.forEach((test, index) =&gt; {
    const result = minDeletionsToMakeStringBalanced(test.s);
    console.log(`Test Case ${index + 1}: ${result === test.expected ? 'Passed' : 'Failed'} (Expected: ${test.expected}, Got: ${result})`);
});
</pre>
</div>

<pre class="example" id="org88f7003">
Processing string: aababbab
Test Case 1: Passed (Expected: 2, Got: 2)
Processing string: bbaaaa
Test Case 2: Passed (Expected: 2, Got: 2)
Processing string: abababab
Test Case 3: Failed (Expected: 4, Got: 3)
Processing string: aaaaa
Test Case 4: Passed (Expected: 0, Got: 0)
Processing string: bbbb
Test Case 5: Passed (Expected: 0, Got: 0)
undefined
</pre>
</div>
</div>
</div>
<div id="postamble" class="status">
&copy; d)zharii. <a href="/sitemap.html">sitemap</a>
</div>
</body>
</html>
